{
	"name": "PVE Plus Ambush",
	"description": "[Lore]\nThe exiled lands are a dangerous place.  Strong prey on the weak, and the next ambush is lurking around the corner.\n\n[Description]\nAt regular intervals a random player level 11 and up will be selected and get ambushed by a set of npc's.  The tier level of the npc's will be calculated on the player level.  The amount of npc's is random from one to three ambushers.  If you are within 10m of a foundation the marked player won't be ambushed yet.  However once he moves past 10m the ambush will trigger.  This mechanic might extend the duration between ambushes.\n\nThe default interval is defined with a minimum of 20 minutes and a variable time added to that of 10 minutes.  This usually means two ambushes an hour.\n\n[Admin]\nServer administrators now have a UI for controlling the mod behavior.  The UI can be opened via a console command or a chat command.\n\nConsole Command\nke * AmbushWidgetConfig\n\nChat Command:\n/ambush_settings\n\n[Thank you note]\n\nI like to thank Scooper, RobTheSwede, Kharzette, Dragoonduneman, Foxcat, shadowCMD, Testerle and many others of the Conan Modding Discord channel for all their help and insights",
	"changeNote": " 1.) Added a settings UI that can only be called by admin.  Gives users the ability to adjust the following settings:\n           - Min Time Between Ambushes (Minimum Amount of Time Between Ambushes)\n           - Max Additional Time Between Ambushes (The random additional amount added to the minimum time between)\n           - Max Spawn Distance (The furthest away an ambush NPC will spawn)\n           - Min Spawn Distance (The closest distance an ambush NPC will spawn in relation to the player)\n           - Ambush Warning Delay Time (The amount of time after the horn sounds before NPCs spawn in)\n           - Maximum Additional Waves (How many times the ambush can instantly repeat if conditions are met)\n           - Pets Toggle (An on / off switch for the pet spawns)\n           - Progression Toggle (An on / off switch for adding or removing spawns outside of your level range)\n\n  2.)  Added a console (~) event (ke * AmbushWidgetConfig) for opening the settings UI.\n\n  3.)  Added a /command (/ambush_settings) for opening the settings UI.\n\n  4.)  All settings save to the server data and can only be edited if you are a server admin.",
	"author": "Celludriel & ArthurGx ",
	"authorUrl": "",
	"versionMajor": 1,
	"versionMinor": 4,
	"versionBuild": 0,
	"bRequiresLoadOnStartup": false,
	"steamPublishedFileId": "1389591415",
	"steamVisibility": 0,
	"folderName": "PvEPlusAmbush",
	"revisionNumber": 149648,
	"snapshotId": 22316
}