{
	"name": "PVE Plus Ambush",
	"description": "[h1][b][u]Description of Mod[/u][/b][/h1]\n\n[code][b]Mod id:[/b] 1389591415[/code]\n\n[quote=] [b]Communication Procedures[/b]\n \nPlease use the following Discord link in order to access manual download links. Previous versions, and most up to date versions will be made available for manual download 1 week after an update is released. It is also the ideal place for communicating with helping to provide descriptive bug reports and other help venues. \n\n[url=https://discord.gg/gbAjAgS][img]https://i.imgur.com/bPcwSl5.png[/img][/url] [/quote]\n\n[b][u]Lore[/u][/b]\nThe exiled lands are a dangerous place.  Strong prey on the weak, and the next ambush is lurking around the corner.\n\n[b][u]Description[/u][/b]\nAt regular intervals a random player level 11 and up will be selected and get ambushed by a set of npc's.  The tier level of the npc's will be calculated on the player level.  The amount of npc's is random from one to three ambushers.  If you are within 10m of a foundation the marked player won't be ambushed yet.  However once he moves past 10m the ambush will trigger.  \n\nThe default interval is defined with a minimum of 20 minutes and a variable time added to that of 10 minutes.  This translates to about two ambushes an hour.\n\n[h1][b][u]Admin Menu Access[/u][/b][/h1]\n\nThis mod has several admin settings available. To access the admin menu, use the following two options:\n[olist]\n\n[*]With admin enabled, access the console (~ or insert) and type DataCMD PvEAmbushConfig\n\n[*]With admin enabled, use [url=https://steamcommunity.com/sharedfiles/filedetails/?id=1823412793][u]ModControlPanel[/u][/url] by hades and press Shift + End to access the admin menu. [/olist] \n\n[h1][b][u]Admin Settings Description[/u][/b][/h1]\n\n[u]Minimum Time Between Ambushes[/u]\nThis represents the minimum amount of time between ambushes. Enter in seconds. (ex. 1200 = 20 mins (1200/60)) \n\n[u]Maximum Extra Time Between Ambushes:[/u] \nThis represent the additional amount of random time between ambushes. This allows you to randomize the ambush clock. Enter in seconds. (ex. 600 = 10 mins(600/60))\n\n[u]Minimum Spawn Distance:[/u]\nThis is a base minimum number for spawn closeness. The spawner will choose a random distance between the max and min. Choose a slider point, the lower the number the closer the spawn. \n\nNote: Setting this number below 20 may result in NPCs spawning right on top of you, pinning you in a position where you cannot move.\n\n[u]Max Spawn Distance:[/u] This is a base maximum for spawn distance. The spawner will choose a random distance between the max and min. Choose a slider point, the lower the number the closer the spawn. \n\nNote: Setting this above 600 may result in spawns that do not aggro on you.\n\n[u]Ambush Warning Time:[/u] This represents the amount of time between the ambush horn and NPCs spawning in. Enter in seconds.\n\n[u]Max Number of Ambushes Per Ambush Event:[/u]\nThis sets the maximum number of ambushes that can trigger server wide after the first ambush event triggers.\n\n[u]Delay Between Immediate Ambushes:[/u]\nThis sets the amount of time between each additional ambush. For example, if 5 ambushes trigger with a delay of 10, the mod will choose players at random 5 times and wait 10 seconds between each ambush spawn. \n\n[u]Additional Ambush Chance:[/u] \nThis sets the percentage chance in which additional ambushes can spawn after the first ambush triggers. Each ambush chooses online players at random.\n\n[u]Minimum Number of Enemies:[/u] \nThe least amount of enemies that can spawn during a single ambush spawn.\n\n[u]Maximum Number of Enemies:[/u] \nThe maximum amount of enemies that can spawn during a single ambush spawn.\n\n[u]Enable 'Exile Lands' Specific Monsters:[/u] \nEnabling this toggle will allow monsters unique to the 'Exile Lands' map to spawn. For example, Frost Giants, Yetis, and Sandbeasts.\n\n[u]Enable 'Isle of Siptah' Specific Monsters:[/u] \nEnabling this toggle will allow monsters unique to the 'Isle of Siptah' map to spawn. For example, Devolved monsters, Bigfoot, and Fiends.\n\n[u]Enable 'Maelstorm' Specific Monsters Found on 'Isle of Siptah':[/u]\nEnabling this toggle will allow monsters unique to the 'Maelstorm' event found on the 'Isle of Siptah' map to spawn. For example, Doels, Ghouls, and Blood Defilers.\n\n[u]Progression Spawning Toggle:[/u]\nUse this toggle to allow all enemies to spawn in randomly regardless of the level. By default (ON) will level lock so only enemies appropriate for character levels will spawn.  \n\nBy changing this toggle to off, any enemy within a characters level and below will spawn. For example, with the setting on, between level 21-40 Dogs of the Desert enemies will spawn on the character, but not Exiles (which are range 10-20). With the setting off, both Dogs of the Desert and Exile enemies will spawn on the character between levels 21-40. \n\n[h1][b][u]Mod Links[/u][/b][/h1]\n\n[b][url=https://steamcommunity.com/id/celludriel/myworkshopfiles/?appid=440900]Celludriel's Other Mod's Can be Found by Clicking Here![/url][/b]\n\n[b][url=https://steamcommunity.com/id/multigun/myworkshopfiles/?appid=440900]Multi's Other Mod's Can be Found by Clicking Here![/url][/b]",
	"changeNote": "[h1][b][u]Version is 1.5.0[/u][/b][/h1]\n\nWe wouldn't classify this as a complete overhaul, but a lot has changed and improved on the back end and front end. Here is a list of the things that have been changed in this update. \n\n[b][u]Changes and Additions[/u][/b]\n[list]\n\n[*]Updated the ke command to utilize the new DataCMD command instead. To access the admin console, you may use DataCMD PvEAmbushConfig or ModControlPanel.\n\n[*]Removed the incomplete user options along with several unused files and code on the back end to optimize things a bit. \n\n[*]Removed the redundant wave limiter option. Admin's can now set the number of additional ambushes themselves. \n\n[*]Added new admin setting for configuring the Max Number of Additional Ambushes that can occur per Ambush Event.\n\n[*]Added new admin setting for configuring the Delay between Additional Ambushes that can occur per Ambush Event.\n\n[*]Added new admin setting for configuring the Percentage chance of an Additional Ambush to occur.\n\n[*]Added new admin settings to configure the minimum and maximum number of enemies that can spawn on the player. \n\n[*]Removed the redundant Pet toggle. Monsters can now spawn as part of the regular ambushes. \n\n[*]Updated and heavily modified what types of enemies can ambush the player. There are now hundreds of different thralls and monsters that can spawn, based on available settings. \n\n[*]Added new toggles for Exile Lands specific monsters, Isle of Siptah specific monsters, and monsters found in the Maelstorm that can spawn on the player when toggled on. Meaning, for example, Ice Giants will spawn when the Exile Lands toggle is on, but not when it's toggled off. \n\n[*]Various improvements and bug fixes.",
	"author": "Celludriel & ArthurGx & Multigun & hades",
	"authorUrl": "",
	"versionMajor": 1,
	"versionMinor": 5,
	"versionBuild": 0,
	"bRequiresLoadOnStartup": false,
	"steamPublishedFileId": "1389591415",
	"steamVisibility": 0,
	"folderName": "PvEPlusAmbush",
	"revisionNumber": 253050,
	"snapshotId": 26819
}