{
	"name": "PVE Plus Ambush",
	"description": "[Lore]\nThe exiled lands are a dangerous place.  Strong prey on the weak, and the next ambush is lurking around the corner.\n\n[Description]\nAt regular intervals a random player level 11 and up will be selected and get ambushed by a set of npc's.  The tier level of the npc's will be calculated on the player level.  The amount of npc's is random from one to three ambushers.  If you are within 10m of a foundation the marked player won't be ambushed yet.  However once he moves past 10m the ambush will trigger.  This mechanic might extend the duration between ambushes.\n\nThe default interval is defined with a minimum of 20 minutes and a variable time added to that of 10 minutes.  This usually means two ambushes an hour.\n\n[Admin]\nServer administrators have the following commands\n\nMinimum time between ambushes:\nke * SetMinTimeBetweenAmbushes <float seconds>\n\nMax time added after the minimum time has been reached:\nke * SetMaxTimeAddedForAmbush <float seconds>\n\n[Thank you note]\n\nI like to thank Scooper, RobTheSwede, Kharzette, Dragoonduneman, Foxcat, shadowCMD, Testerle and many others of the Conan Modding Discord channel for all their help and insights",
	"changeNote": "1.)  Ambush Start Shelter Check- Added a check to see if the player is under shelter and followed your normal delay routine if they are.  This prevents many of the ambushers who spawned in cave walls or outside the playable area.\n2.)  Additional Ambush Waves - I couldn't seem to increase the number of ambushers beyond 2.  Don't know why, so instead I added a low random chance that shortly after the first 1-2 ambushers spawn in another ambush could happen immediately.  The chance of this happening is very low and dependent on the each previous wave, so the chance for 4 waves is much lower than 3 and 3 much lower than 2.\n3.)  Added a 10 second delay between the ambush horn and when the ambushers spawn in.  This is allows a player to move away from the water or a wall so that the ambushers properly spawn in.  It also simulates that brief moment when you know pvp is about to happen.\n4.)  Ambush NPC Spawner - The routine will still use your 9 cycles of checking for a proper spawn spot.  If one cannot be found which is quite often the case, NPCs will now spawn a random short distance away from the player instead of right on top of them.  This has prevented the ambushers from pinning the player in a helpless position.\n5.)  Added pets to the waves - This is working great, but probably needs some adjustment so that lists spawn the proper pets per level.\n6.)  I adjusted the npc selector so that lower level npcs can still spawn in as you level up.  The think I had was as a high level player I could still have a naked newb run up to me and start swinging.  Basically it just adds the higher tiers to the spawn table as you go.",
	"author": "Celludriel & ArthurGx ",
	"authorUrl": "",
	"versionMajor": 1,
	"versionMinor": 3,
	"versionBuild": 1,
	"bRequiresLoadOnStartup": false,
	"steamPublishedFileId": "1389591415",
	"steamVisibility": 0,
	"folderName": "PvEPlusAmbush",
	"revisionNumber": 149648,
	"snapshotId": 22316
}