{
	"name": "PvE Plus Ambush - v1.5.2",
	"description": "[h1][b][u]IMPORTANT RECENT NEWS[/u][/b][/h1]\n\nMod is updated and compatible with the latest revision of the game. See Change Notes as appropriate for new changes and additions. \n\nAll manual downloads now require logging into the Discord server for access, including previous versions.\n\n[h1][b][u]Mod Updating Guidelines[/u][/b][/h1]\n\nIf you are having trouble updating the mod, [url=https://docs.google.com/spreadsheets/d/1HG2riTjeLdDGf9K_EL6SiHe31tSWZYsq1iWFrslUSbM/edit#gid=1704191777&range=D1:L1][u]please visit this documentation.[/u][/url]\n\n[h1][b][u]Description of Mod[/u][/b][/h1]\n\n[code][b]Mod id:[/b] 1389591415[/code]\n\n[quote=] [b]Communication[/b]\n \nPlease direct questions, comments, concerns, feedback, and bug reports to our Discord. The Discord link is the button below.\n\n[url=https://discord.gg/gbAjAgS][img]https://i.imgur.com/bPcwSl5.png[/img][/url] [/quote]\n\n[b][u]Lore[/u][/b]\nThe exiled lands are a dangerous place. Strong prey on the weak, and the next ambush is lurking around the corner.\n\n[b][u]Description[/u][/b]\n\nThis is a relaunch of the PvE Plus Ambush mod to better assist the original author of the mod, Celludriel. Safe to replace the previous version with this one. \n\nAt regular intervals a random player level 11 and up will be selected and get ambushed by a set of npc's.  The tier level of the NPC's will be calculated on the player level.  The amount of NPC's is random from one to three ambushers.  If you are within 10m of a foundation the marked player won't be ambushed yet.  However once he moves past 10m the ambush will trigger.  \n\nThe default interval is defined with a minimum of 20 minutes and a variable time added to that of 10 minutes.  This translates to about two ambushes an hour.\n\n[h1][b][u]Admin Menu Access[/u][/b][/h1]\n\nThis mod has several admin settings available. To access the admin menu, use the following two options:\n[olist]\n\n[*]With admin enabled, access the console (~ or insert) and type DataCMD PvEAmbushConfig\n\n[*]With admin enabled, use [url=https://steamcommunity.com/sharedfiles/filedetails/?id=1823412793][u]ModControlPanel[/u][/url] by hades and press Shift + End to access the admin menu. [/olist] \n\n[h1][b][u]Admin Settings Description[/u][/b][/h1]\n\n[h2]Time Settings[/h2]\n\n[u]Minimum Time Between Ambushes[/u]\nThis represents the minimum amount of time between ambushes. Enter in seconds. (ex. 1200 = 20 mins (1200/60)) \n\n[u]Maximum Extra Time Between Ambushes:[/u] \nThis represent the additional amount of random time between ambushes. This allows you to randomize the ambush clock. Enter in seconds. (ex. 600 = 10 mins(600/60))\n\n[u]Ambush Warning Time:[/u] This represents the amount of time between the ambush horn and NPCs spawning in. Enter in seconds.\n\n[h2]Distance Settings[/h2]\n\n[u]Minimum Spawn Distance:[/u]\nThis is a base minimum number for spawn closeness. The spawner will choose a random distance between the max and min. Choose a slider point, the lower the number the closer the spawn. \n\nNote: Setting this number below 20 may result in NPCs spawning right on top of you, pinning you in a position where you cannot move.\n\n[u]Max Spawn Distance:[/u] This is a base maximum for spawn distance. The spawner will choose a random distance between the max and min. Choose a slider point, the lower the number the closer the spawn. \n\nNote: Setting this above 600 may result in spawns that do not aggro on you.\n\n[h2]Additional Ambush Settings[/h2]\n\nThese settings will affect how many additional ambushes that occur during an ambush event. \n\n[u]Max Number of Ambushes Per Ambush Event:[/u]\nThis sets the maximum number of ambushes that can trigger server wide after the first ambush event triggers.\n\n[u]Delay Between Immediate Ambushes:[/u]\nThis sets the amount of time between each additional ambush. For example, if 5 ambushes trigger with a delay of 10, the mod will choose players at random 5 times and wait 10 seconds between each ambush spawn. \n\n[u]Additional Ambush Chance:[/u] \nThis sets the percentage chance in which additional ambushes can spawn after the first ambush triggers. Each ambush chooses online players at random.\n\n[h2]Enemy Number and Type Settings[/h2]\n\n[u]Minimum Number of Enemies:[/u] \nThe least amount of enemies that can spawn during a single ambush spawn.\n\n[u]Maximum Number of Enemies:[/u] \nThe maximum amount of enemies that can spawn during a single ambush spawn.\n\n[u]Enable 'Exile Lands' Specific Monsters:[/u] \nEnabling this toggle will allow monsters unique to the 'Exile Lands' map to spawn. For example, Frost Giants, Yetis, and Sandbeasts.\n\n[u]Enable 'Isle of Siptah' Specific Monsters:[/u] \nEnabling this toggle will allow monsters unique to the 'Isle of Siptah' map to spawn. For example, Devolved monsters, Bigfoot, and Fiends.\n\n[u]Enable 'Maelstorm' Specific Monsters Found on 'Isle of Siptah':[/u]\nEnabling this toggle will allow monsters unique to the 'Maelstorm' event found on the 'Isle of Siptah' map to spawn. For example, Doels, Ghouls, and Blood Defilers.\n\n[h2]Difficulty Adjustments[/h2]\n\n[u]Progression Spawning Toggle:[/u]\nUse this toggle to allow all enemies to spawn in randomly regardless of the level. By default (ON) will level lock so only enemies appropriate for character levels will spawn.  \n\nBy changing this toggle to off, any enemy within a characters level and below will spawn. For example, with the setting on, between level 21-40 Dogs of the Desert enemies will spawn on the character, but not Exiles (which are range 10-20). With the setting off, both Dogs of the Desert and Exile enemies will spawn on the character between levels 21-40. \n\n[quote][h1][b][u]Update Policy[/u][/b][/h1]\n\nConan Exiles, as with many other games with mod support, can sometimes suffer from when mod authors decide to no longer update or abandon their mods. Since April of 2018, I have maintained that I will always keep my mods updated and available, and I do take that responsibility seriously. \n\nAlong with that commitment, is my desire to grow and improve all my mods. Sometimes my vision differs from the players that use my mods, and sometimes changes are done because of player input. Inevitably, an update will eventually come for one of my mods whenever necessary, whether that is bug fixes, improvements, or new features. What is unexpected is the volume of negative comments that I receive with every update. \n\nHere is my update policy. The world is a 24 hour world, and when I update a mod, it may not match when your server happens to restart. I cannot control that, everybody has different update schedules. Neither am I able to control when you receive a mismatch error, or have issues downloading the mod. Mod authors have [u]NO CONTROL[/u] when issues between you, Steam, or your server occur. At the top of this workshop page is the most common troubleshooting steps I can suggest you try, but outside of that, I cannot provide any further support. \n\nI am committed to making my mods the best that they can be. But I need you to also be on board with helping me achieve those goals, and to be flexible whenever a mod update is planned. Please keep this in mind when leaving feedback. [/quote]\n\n[b][url=https://steamcommunity.com/id/celludriel/myworkshopfiles/?appid=440900]Celludriel's Other Mod's Can be Found by Clicking Here![/url][/b]\n\n[b][url=https://steamcommunity.com/id/multigun/myworkshopfiles/?appid=440900]Multi's Other Mod's Can be Found by Clicking Here![/url][/b]",
	"changeNote": "[h1][b][u]Version is 1.5.2[/u][/b][/h1]\n\n[b][u]Bug Fixes, Changes, and Adjustments[/u][/b][list]\n\n[*]Compatibility update with the latest revision of the game. [/list]\n\n[b][u]Additional Notes[/u][/b]\n\nPrior to the latest update, I looked over some known instances of enemies fighting each other when they should be attacking the player (during 1 ambush event, not multiple). Two instances of this are known, one with the Darfari and their pet Ostriches, and the Votaries faction. In both cases (upon my investigations), this is due to a bug with the game and how those factions \"communities\" are set up. Bug report has been sent off to Funcom. \n\nIf you know of any other instance of this, or other weird instances where during a single ambush event you see the enemies turn on each other, please let me know so I can properly investigate. Thank you. ",
	"author": "Celludriel, Multigun, hades",
	"authorUrl": "",
	"versionMajor": 1,
	"versionMinor": 5,
	"versionBuild": 2,
	"bRequiresLoadOnStartup": false,
	"steamPublishedFileId": "2582718886",
	"steamVisibility": 2,
	"folderName": "PvEPlusAmbush",
	"revisionNumber": 314055,
	"snapshotId": 30574
}