{
	"name": "PvE Plus Treasure Hunt",
	"description": "[Lore]\nFor as long as can be remembered people have stored their price processions in secure chests.  The people in the exiled lands are none different.  Unfortunately the monstrous wildlife in these lands are drawn to them.  Much to the owners despair.  Scouts over time have found these treasure troves and scribbled their location down on brittle maps.  Eventually even these got lost , destroyed or divided.  However for those that find these scraps of paper, and know how to restore them, danger and riches await.  \n\n[Description]\nKilling thralls sometimes yield scraps of map pieces.  Bring five of them together in the artisan bench after learning the free recipe and you will yield a usable map.\nAfter using the map, a treasure marker will appear on the global map for five minutes.  Make sure to put a personal marker closeby not to forget where.  This treasure marker is also globally visible for everyone.\nThe treasure will be there for twelve hours.  Some of them are located in dangerous places and will need a decent preparation.  All of them are guarded by boss monsters that will not yield easy.\nAfter killing the boss, a bag will drop next to it containing a key, usable only on that particular treasure chest.  The chest will remain for two minutes after killing the guardian.  So loot fast.\n\n[Developer notes]\n\n- The reason why the treasure marker is globally visible, is because in the devkit the API for markers is severely limited.  I can't make private markers, and the global markers can not be removed, they can only have an expiry time\n- I tried to chose different boss monsters that are fit in the region the treasure spawns but this can be improved a lot.\n- If you build a foundation within 50m of a spot where a treasure can spawn, the treasure will never spawn again there.  This to prevent abuse.\n- I have tested this mod trying to catch each situtation but if you do encounter something weird please let me know.  This mod might have a few more bugs then my ambush one.  It was a lot harder to put together.",
	"changeNote": "- Changed the loot of the treasure chests\n\nLow treasure: Enough materials to make 2 dragonpowder\nMed treasure: Enough materials to make 5 dragonpowder\nHigh treasure: Enough materials to make 10 dragonpowder and a small amount of obsidian",
	"author": "Celludriel",
	"authorUrl": "",
	"versionMajor": 1,
	"versionMinor": 1,
	"versionBuild": 0,
	"bRequiresLoadOnStartup": false,
	"steamPublishedFileId": "1393568478",
	"steamVisibility": 0,
	"folderName": "PvEPlusTreasureHunt",
	"revisionNumber": 100728,
	"snapshotId": 18311
}