{
	"name": "PvE Plus Travelling Merchant",
	"description": "[Lore]\nWhile a lot of people see the Exiled Lands as punishment, others see opportunity.  Deekin always had a nose for those, as such he became a merchant in bulk wares.  In one of his travels he learned the secret of passing the cursed barrier both ways unscathed and ever since his fortunes rose to unseen heights.  He started traveling into the Exiled Lands offering a meager sum for big quantities of goods that the exiled massed up during their punishment.  For a low cost he brought back those goods to the civilized world massing riches selling them there once more.\n\n[Description]\nEver so often Deekin will visit the lands.  Default this is set to every hour after previous visit.  An announcement will be made where he appears somewhere in the lands, you'll still have to go look for him but you'll know whereabouts.  Once you find him you can talk to him and he'll tell you what he is looking for.  \n\nNext to him there is a chest, this one is special.  The chest will retain all items put in on guild/clan level.  So any items put in by guild A will not be seen by guild B.  However if you put in items guildless ... All guildless people will be able to add or take items to the chest !  Once you put in enough items to satisfy Deekins request, your reward will spawn into the chest.\n\nThirty minutes before Deekin leaves everyone will be warned of his impending departure.  If any guild still has items in his chest when he does leave, well Deekin is a very impatient man.  He will toss all items out of the chest from all guilds into one big bag on the ground.  Everyone will be able to loot that bag !\n\n[Developer Notes]\nI made this mod to introduce a resource sink.  After three weeks play I had so much excess and throwing it all away seemed so meaningless.  Deekin is my way to try and introduce a fair resource sink, with as little s faucet as possible, but still reward the player for all his time spent.  Is it perfect ?  Probably not, since there aren't to many resources a player actually craves even late game.\n\n[Mod Collaboration]\nThere currently is only one offer 1000 Thick Hide for 2 Gold.  I didn't do this because I'm lazy, I did this to spark collaboration.  Tell me what deals you find fair and I'll add them to the mod.  Make a thread in the mod's discussion forum with any deals you find fair.  If they are reasonable, other people can comment on them of course.  I'll add them to the mod on a regular basis.\n\n[Admin]\nServer administrators have the following commands\n\nTime between visits: (default: 1)\nke * SetTimeBetweenVisits <int hours>\n\nTime Deekin stays in the exiled lands: (default: 2)\nke * SetVisitDuration <int hours>",
	"changeNote": "- Dev Kit upgrade",
	"author": "Celludriel",
	"authorUrl": "",
	"versionMajor": 1,
	"versionMinor": 0,
	"versionBuild": 1,
	"bRequiresLoadOnStartup": false,
	"steamPublishedFileId": "1404438016",
	"steamVisibility": 0,
	"folderName": "PvEPlusTrade",
	"revisionNumber": 100728,
	"snapshotId": 18311
}